Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [5]:
Series_list = pd.Series([4,8,15,16,23,42])

In [6]:
print(Series_list)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
var_list=[0,1,2,3,4,5,6,7,8,9]

In [8]:
var_list_series=pd.Series([var_list])

In [9]:
print(var_list)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [10]:
var_list_series

0    [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame.

In [14]:
#Import pandas library
import pandas as pd

#Create List of lists
data=[['Alice',25,'Female'],['Bob',30,'Male'],['Claire',47,'Female']]

In [15]:
data

[['Alice', 25, 'Female'], ['Bob', 30, 'Male'], ['Claire', 47, 'Female']]

In [23]:
df=pd.DataFrame(data,columns=['Name','Age','Gender'],index=None)

In [24]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   47  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Data Structure refers to the specialized way of organizing, processing, and storing data to apply specific types of functionalities to them. 

Pandas has two main types of Data Structures based on their dependability –

Series: 1D labeled array

DataFrame: 2D labeled tabular structure

Pandas Series: 	
One-dimensional	

Pandas DataFrame :
Two-dimensional

Pandas Series: 
Homogenous – Series elements must be of the same data type.	

Pandas DataFrame :
Heterogenous – DataFrame elements can have different data types.

Pandas Series: 
Size-immutable – Once created, the size of a Series object cannot be changed.

Pandas DataFrame :
Size-mutable – Elements can be dropped or added in an existing DataFrame.

Creating a Pandas Series Using ndarray
If data is a ndarray, the index must be of the same length as the array. If index is not specified, it will be created automatically with values: [0, …, len(data) – 1].

NumPy library has a function random.randint() that produces a ndarray populated with random integers, let’s use that here:

In [3]:
#Creating a Series from ndarray
import numpy as np
import pandas as pd 
data = np.random.randn(5)

series = pd.Series(data=data, 
                   index=['one', 'two', 'three', 'four', 'five'],
                   name='series_from_ndarray')
print(series)

one     -0.666072
two     -1.129698
three   -0.542224
four    -0.352490
five     0.745375
Name: series_from_ndarray, dtype: float64

Creating a Pandas DataFrame Using a Dictionary of Pandas Series
The index must be the same length as the Series. If index is not specified, it will be created automatically with values: [0, …, len(data) – 1].

In [6]:
#Creating a DataFrame from a dictionary of Series
data = pd.DataFrame({
    "Class 1": pd.Series([22, 33, 38], index=["math avg", "science avg",  "english avg"]),
    "Class 2": pd.Series([45, 28, 36], index=["math avg", "science avg",  "english avg"]),
    "Class 3": pd.Series([32, 41, 47], index=["math avg", "science avg",  "english avg"])})

In [7]:
data

             Class 1  Class 2  Class 3
math avg          22       45       32
science avg       33       28       41
english avg       38       36       47

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

1) read_csv : To read the csv file

In [8]:
# import module
import pandas as pd

# assign dataset
df = pd.read_csv("country_code.csv")

# display
print("Type-", type(df))

Type- <class 'pandas.core.frame.DataFrame'>

In [9]:
df

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

2) Head

We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.

In [10]:
df.head(10)

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
5              Andorra   AD
6               Angola   AO
7             Anguilla   AI
8           Antarctica   AQ
9  Antigua and Barbuda   AG

3) df.shape() :
Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple.

In [11]:
df.shape

(249, 2)

4) df.describe : Summary of Statistics of DataFrame using describe() method.

In [13]:
df.describe()

               Name Code
count           249  246
unique          249  246
top     Afghanistan   AF
freq              1    1

5) df.dropna() : Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.

In [14]:
df.dropna()

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[246 rows x 2 columns]

In [15]:
df.dropna(axis=1)

                  Name
0          Afghanistan
1        Åland Islands
2              Albania
3              Algeria
4       American Samoa
..                 ...
244  Wallis and Futuna
245     Western Sahara
246              Yemen
247             Zambia
248           Zimbabwe

[249 rows x 1 columns]

Merging DataFrames using merge(), arguments passed are the dataframes to be merged along with the column name.

In [16]:
df1 = pd.read_csv("country_code.csv")
merged_col = pd.merge(df, df1, on='Name')
merged_col

                  Name Code_x Code_y
0          Afghanistan     AF     AF
1        Åland Islands     AX     AX
2              Albania     AL     AL
3              Algeria     DZ     DZ
4       American Samoa     AS     AS
..                 ...    ...    ...
244  Wallis and Futuna     WF     WF
245     Western Sahara     EH     EH
246              Yemen     YE     YE
247             Zambia     ZM     ZM
248           Zimbabwe     ZW     ZW

[249 rows x 3 columns]

An additional argument ‘on’ is the name of the common column, here ‘Name’ is the common column given to the merge() function. df is the first dataframe & df1 is the second dataframe that is to be merged.

Renaming the columns of dataframe using rename(), arguments passed are the columns to be renamed & inplace.

In [17]:
country_code = df.rename(columns={'Name': 'CountryName',
								'Code': 'CountryCode'},
						inplace=False)
country_code

           CountryName CountryCode
0          Afghanistan          AF
1        Åland Islands          AX
2              Albania          AL
3              Algeria          DZ
4       American Samoa          AS
..                 ...         ...
244  Wallis and Futuna          WF
245     Western Sahara          EH
246              Yemen          YE
247             Zambia          ZM
248           Zimbabwe          ZW

[249 rows x 2 columns]

Creating a dataframe manually:

In [18]:
student = pd.DataFrame({'Name': ['Rohan', 'Rahul', 'Gaurav',
								'Ananya', 'Vinay', 'Rohan',
								'Vivek', 'Vinay'],
						
						'Score': [76, 69, 70, 88, 79, 64, 62, 57]})

# Reading Dataframe
student

     Name  Score
0   Rohan     76
1   Rahul     69
2  Gaurav     70
3  Ananya     88
4   Vinay     79
5   Rohan     64
6   Vivek     62
7   Vinay     57

Sorting the DataFrame using sort_values() method.

In [19]:
student.sort_values(by=['Score'], ascending=True)

     Name  Score
7   Vinay     57
6   Vivek     62
5   Rohan     64
1   Rahul     69
2  Gaurav     70
0   Rohan     76
4   Vinay     79
3  Ananya     88

In [20]:
student.sort_values(by=['Name'], ascending=True)

     Name  Score
3  Ananya     88
2  Gaurav     70
1   Rahul     69
0   Rohan     76
5   Rohan     64
4   Vinay     79
7   Vinay     57
6   Vivek     62

Sorting the DataFrame using multiple columns:

In [21]:
student.sort_values(by=['Name', 'Score'],
					ascending=[True, False])

     Name  Score
3  Ananya     88
2  Gaurav     70
1   Rahul     69
0   Rohan     76
5   Rohan     64
4   Vinay     79
7   Vinay     57
6   Vivek     62

Creating another column in DataFrame, Here we will create column name percentage which will calculate the percentage of student score by using aggregate function sum().

In [22]:
student['Percentage'] = (student['Score'] / student['Score'].sum()) * 100
student

     Name  Score  Percentage
0   Rohan     76   13.451327
1   Rahul     69   12.212389
2  Gaurav     70   12.389381
3  Ananya     88   15.575221
4   Vinay     79   13.982301
5   Rohan     64   11.327434
6   Vivek     62   10.973451
7   Vinay     57   10.088496

Selecting DataFrame rows using logical operators:

In [23]:
# Selecting rows where score is
# greater than 70
print(student[student.Score>70])

# Selecting rows where score is greater than 60
# OR less than 70
print(student[(student.Score>60) | (student.Score<70)])

     Name  Score  Percentage
0   Rohan     76   13.451327
3  Ananya     88   15.575221
4   Vinay     79   13.982301
     Name  Score  Percentage
0   Rohan     76   13.451327
1   Rahul     69   12.212389
2  Gaurav     70   12.389381
3  Ananya     88   15.575221
4   Vinay     79   13.982301
5   Rohan     64   11.327434
6   Vivek     62   10.973451
7   Vinay     57   10.088496

Indexing & Slicing :
Here .loc is label base & .iloc is integer position based methods used for slicing & indexing of data.

In [24]:
# Printing five rows with name column only
# i.e. printing first 5 student names.
print(student.loc[0:4, 'Name'])

# Printing all the rows with score column
# only i.e. printing score of all the
# students
print(student.loc[:, 'Score'])

# Printing only first rows having name,
# score columns i.e. print first student
# name & their score.
print(student.iloc[0, 0:2])

# Printing first 3 rows having name,score &
# percentage columns i.e. printing first three
# student name,score & percentage.
print(student.iloc[0:3, 0:3])

# Printing all rows having name & score
# columns i.e. printing all student
# name & their score.
print(student.iloc[:, 0:2])

0     Rohan
1     Rahul
2    Gaurav
3    Ananya
4     Vinay
Name: Name, dtype: object
0    76
1    69
2    70
3    88
4    79
5    64
6    62
7    57
Name: Score, dtype: int64
Name     Rohan
Score       76
Name: 0, dtype: object
     Name  Score  Percentage
0   Rohan     76   13.451327
1   Rahul     69   12.212389
2  Gaurav     70   12.389381
     Name  Score
0   Rohan     76
1   Rahul     69
2  Gaurav     70
3  Ananya     88
4   Vinay     79
5   Rohan     64
6   Vivek     62
7   Vinay     57

Apply Functions, this function is used to apply a function along an axis of dataframe whether it can be row (axis=0) or column (axis=1).

In [25]:
# explicit function
def double(a):
	return 2*a

student['Score'] = student['Score'].apply(double)

# Reading Dataframe
student

     Name  Score  Percentage
0   Rohan    152   13.451327
1   Rahul    138   12.212389
2  Gaurav    140   12.389381
3  Ananya    176   15.575221
4   Vinay    158   13.982301
5   Rohan    128   11.327434
6   Vivek    124   10.973451
7   Vinay    114   10.088496

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series – 1D labeled homogeneous array, sizeimmutable

Data Frames – 2D labeled, size-mutable tabular structure with heterogenic columns

Panel – 3D labeled size mutable array.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In pandas, Series is a one-dimensional labeled array capable of holding any data type(integers, strings, floating-point numbers, Python objects, etc.). Series stores data in sequential order. It is one-column information similar to a columns in an excel sheet/SQL table.

By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [1]:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000

In [2]:

# Create Series by assigning names
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis=1)
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000